

# DECR

### Syntax:

```bash
DECR key
```

###### **Available since:** 1.0.0
###### **Time complexity:** O(1)

###### **Description:** Decrements the number stored at key by one. If the key does not exist, it is set to 0 before performing the operation. An error is returned if the key contains a value of the wrong type or contains a string that can not be represented as integer. This operation is limited to 64 bit signed integers.

See INCR for extra information on increment/decrement operations.

#### Examples

```bash
orion> SET mykey "10"
"OK"
orion> DECR mykey
(integer) 9
orion> SET mykey "234293482390480948029348230948"
"OK"
orion> DECR mykey
(error) value is not an integer or out of range
orion>

```