

# GETEX

### Syntax:

```bash
GETEX key [EX seconds | PX milliseconds | EXAT unix-time-seconds |
  PXAT unix-time-milliseconds | PERSIST]
```

###### **Available since:** 1.0.0
###### **Time complexity:** O(1)

###### **Description:** Get the value of key and optionally set its expiration. GETEX is similar to GET, but is a write command with additional options.

##### Options
The GETEX command supports a set of options that modify its behavior:

- EX seconds -- Set the specified expire time, in seconds.
- PX milliseconds -- Set the specified expire time, in milliseconds.
- EXAT timestamp-seconds -- Set the specified Unix time at which the key will expire, in seconds.
- PXAT timestamp-milliseconds -- Set the specified Unix time at which the key will expire, in milliseconds.
- PERSIST -- Remove the time to live associated with the key.

#### Examples

```bash
orion> SET mykey "Hello"
"OK"
orion> GETEX mykey
"Hello"
orion> TTL mykey
(integer) -1
orion> GETEX mykey EX 60
"Hello"
orion> TTL mykey
(integer) 60
orion> 

```